1-6: set up notebook and import all packages and files

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
gdp_df = pd.read_csv("../data/gdp_percapita.csv", nrows=6868).drop(labels=['Value Footnotes'], axis=1)
gdp_df.head(6)

  Country or Area  Year        Value
0     Afghanistan  2019  2065.036398
1     Afghanistan  2018  2033.779002
2     Afghanistan  2017  2058.383832
3     Afghanistan  2016  2057.062164
4     Afghanistan  2015  2068.265904
5     Afghanistan  2014  2102.385234

In [3]:
internet_df = pd.read_csv("../data/internet_use.csv", nrows=4495).drop(labels=['Value Footnotes'], axis=1)
internet_df.head(6)

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000
5     Afghanistan  2009  3.550000

#fixed upload error by halting rows holding footnotes

7: Look at the shape of each DataFrame - how many rows? How many columns?
#gdp:[6868 rows x 4 columns], internet:[4495 rows x 4 columns]

#edited original csv read to exclude 'value footnotes' column for both dataframes. now only 3 columns

8: Take a look at the datatypes for the columns in each DataFrame.

In [4]:
print(gdp_df)

     Country or Area  Year        Value
0        Afghanistan  2019  2065.036398
1        Afghanistan  2018  2033.779002
2        Afghanistan  2017  2058.383832
3        Afghanistan  2016  2057.062164
4        Afghanistan  2015  2068.265904
...              ...   ...          ...
6863        Zimbabwe  1994  3263.934978
6864        Zimbabwe  1993  3033.504852
6865        Zimbabwe  1992  3054.889178
6866        Zimbabwe  1991  3426.598094
6867        Zimbabwe  1990  3324.348171

[6868 rows x 3 columns]

In [5]:
print(internet_df)

     Country or Area  Year     Value
0        Afghanistan  2014  6.390000
1        Afghanistan  2013  5.900000
2        Afghanistan  2012  5.454545
3        Afghanistan  2011  5.000000
4        Afghanistan  2010  4.000000
...              ...   ...       ...
4490        Zimbabwe  1997  0.033080
4491        Zimbabwe  1996  0.016790
4492        Zimbabwe  1995  0.007684
4493        Zimbabwe  1994  0.001739
4494        Zimbabwe  1990  0.000000

[4495 rows x 3 columns]

8: Take a look at the datatypes for the columns in each DataFrame.

In [6]:
list(gdp_df.dtypes)

[dtype('O'), dtype('int64'), dtype('float64')]

In [7]:
list(internet_df.dtypes)

[dtype('O'), dtype('int64'), dtype('float64')]

9: Take a look at the last 10 rows of each DataFrame in turn.

In [8]:
gdp_df.tail()

     Country or Area  Year        Value
6863        Zimbabwe  1994  3263.934978
6864        Zimbabwe  1993  3033.504852
6865        Zimbabwe  1992  3054.889178
6866        Zimbabwe  1991  3426.598094
6867        Zimbabwe  1990  3324.348171

In [9]:
internet_df.tail()

     Country or Area  Year     Value
4490        Zimbabwe  1997  0.033080
4491        Zimbabwe  1996  0.016790
4492        Zimbabwe  1995  0.007684
4493        Zimbabwe  1994  0.001739
4494        Zimbabwe  1990  0.000000

10: Drop the value footnotes column from both DataFrames. Check that this worked as expected.

#completed during initial csv read

11: Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

12: Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [31]:
print(gdp_df.rename(columns = {'Country or Area': 'Country', 'Value': 'GDP_Per_Capita'}))
print(internet_df.rename(columns = {'Country or Area': 'Country', 'Value': 'Internet_Users_Pct'}))
gdp_and_internet_use = pd.merge(gdp_df,internet_df,on=['Country or Area','Year'])
print(gdp_and_internet_use)

          Country  Year  GDP_Per_Capita
0     Afghanistan  2019     2065.036398
1     Afghanistan  2018     2033.779002
2     Afghanistan  2017     2058.383832
3     Afghanistan  2016     2057.062164
4     Afghanistan  2015     2068.265904
...           ...   ...             ...
6863     Zimbabwe  1994     3263.934978
6864     Zimbabwe  1993     3033.504852
6865     Zimbabwe  1992     3054.889178
6866     Zimbabwe  1991     3426.598094
6867     Zimbabwe  1990     3324.348171

[6868 rows x 3 columns]
          Country  Year  Internet_Users_Pct
0     Afghanistan  2014            6.390000
1     Afghanistan  2013            5.900000
2     Afghanistan  2012            5.454545
3     Afghanistan  2011            5.000000
4     Afghanistan  2010            4.000000
...           ...   ...                 ...
4490     Zimbabwe  1997            0.033080
4491     Zimbabwe  1996            0.016790
4492     Zimbabwe  1995            0.007684
4493     Zimbabwe  1994            0.001739
4494     Zimbabwe  1990            0.000000

[4495 rows x 3 columns]
     Country or Area  Year      Value_x   Value_y
0        Afghanistan  2019  2065.036398       NaN
1        Afghanistan  2018  2033.779002       NaN
2        Afghanistan  2017  2058.383832       NaN
3        Afghanistan  2016  2057.062164       NaN
4        Afghanistan  2015  2068.265904       NaN
...              ...   ...          ...       ...
7900           Yemen  1999          NaN  0.056629
7901           Yemen  1998          NaN  0.023323
7902           Yemen  1997          NaN  0.015025
7903           Yemen  1996          NaN  0.000621
7904           Yemen  1990          NaN  0.000000

[7905 rows x 4 columns]

13: Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

14: Look at the first five rows of your new DataFrame to confirm it merged correctly.

15: Look at the last five rows to make sure the data is clean and as expected.

16: Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

17: Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

18: Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab key for auto-complete options).

19: Which country had the lowest percentage of internet users in 2014? What was the percentage?

20: Repeat for 2004 and 2009.

21: Which country had the highest gdp per capita in 2014? What was the gdp per capita?

22: Which country had the lowest gdp per capita in 2014? What was the gdp per capita?

23: Create some scatterplots:
a. 2004 Percent Using the Internet vs GDP Per Capita
b. 2009 Percent Using the Internet vs GDP Per Capita
c. 2014 Percent Using the Internet vs GDP Per Capita

24: Are there differences across years? What do the plots tell you about any relationship between these two variables? Enter your observations as a markdown cell.

25: Look at the distribution of gdp per capita values for 2014. Is it unimodal?

26: Look at the distribution of Internet Use for 2014. Is it unimodal?

27: What are the top 5 countries in terms of internet use in 2014?

28: Create a DataFrame called top_5_internet from the combined DataFrame that has all three years for the 5 countries that had the greatest 2014 internet usage. You should have 15 rows. Check that this is true.

29: Create a seaborn FacetGrid to show the internet usage trend across the years 2004, 2009, and 2014 for these 5 countries (those with the highest reported internet use in 2014). Which country had the greatest growth between 2004 and 2014?

30: Repeat the steps above to look at the trend for the 5 countries with the lowest 2014 internet usage. Which country has consistently had the least internet use?

31: Find the top 5 countries for 2014 in terms of GDP per capita; create a DataFrame to look at 10-year trends (use 2004, 2009, 2014 to look at the 10-year trend) in gdp per capita for the 5 countries with the highest 2014 GDP per capita. Use a seaborn facet grid for this.

32: Repeat this one more time to look at 10-year trend for the 5 countries for 2014 with the lowest GDP per capita.

33: Is there anything surprising or unusual in any of these plots? Searching on the internet, can you find any possible explanations for unusual findings?

BONUS: Download another data set from the UN data (http://data.un.org/Explorer.aspx) to merge with your data and explore.